/* Localized versions of QuickTime Player strings */
"qtpMovie" = "Elokuva";
"qtpElement" = "Elementti";
"qtpLayout" = "Asettelu";
"qtpText" = "Teksti";

"qtpIndeterminateTime" = "Tuntematon";
/* A/V Controls */
"avControls" = "Ääni- ja videosäätimet";

/* preferences */
"qtpPreferencesToolbarLabelGeneral" = "Yleiset";
"qtpPreferencesToolbarLabelFullscreen" = "Koko näyttö";
"qtpPreferencesToolbarLabelCapture" = "Tallentaminen";
"qtpPreferencesNoDeviceAvailable" = "(Ei käytettäviä laitteita)";
"qtpPreferencesChoose" = "Valitse";
"qtpPreferencesCaptureDeviceAutomatic" = "Automaattinen";
"qtpPreferencesCaptureDeviceUnavailable" = " (Ei käytettävissä)";
"qtpPreferencesCaptureDeviceNameAndInputName" = "%@: %@"; /* e.g. "Built-In Audio: Line In" */
"qtpPreferencesCaptureAudioDeviceNameiSight" = "Sisäänrakennettu iSight";

"qtpCaptureSmall" = "Parempi (H.264)";
"qtpCaptureSmallDescription" = "Parempi jakamiseen sähköpostilla ja verkossa.\n%lu x %lu video, 128 kb/s AAC-ääni";
"qtpCaptureSmallAlt" = "Hyvä (MPEG-4)";
"qtpCaptureSmallAltDescription" = "Hyvä jakamiseen sähköpostilla ja verkossa.\n%lu x %lu video, 128 kb/s AAC-ääni";
"qtpCaptureLarge" = "Paras (H.264)";
"qtpCaptureLargeDescription" = "Paras jakamiseen sähköpostilla ja verkossa.\n%lu x %lu video, 128 kb/s AAC-ääni";
"qtpCaptureNative" = "Laitteen alkuperäinen";
"qtpCaptureNativeDescription" = "Paras jälkikäsittelyä varten.\nPakkaamaton video ja ääni, suuret tiedostot.";

/* menu items */
"qtpShowMovieInfo" = "Näytä elokuvan tiedot";
"qtpHideMovieInfo" = "Näytä elokuvan tiedot"; /* Movie Info gets re-revealed */
"qtpShowMovieInspector" = "Näytä elokuvainspektori";
"qtpHideMovieInspector" = "Kätke elokuvainspektori";
"qtpClearMenu" = "Tyhjennä valikko";
"qtpSelectScript" = "Valitse skripti";
"qtpRun" = "Suorita";
"qtpShowPitchShift" = "Näytä PitchShift";
"qtpNewMovieRecording" = "Uusi elokuvatallenne";
"qtpNewAudioRecording" = "Uusi äänitallenne";
"qtpMovieRecording" = "Elokuvatallennus";
"qtpAudioRecording" = "Äänitallennus";
"qtpShowAVControls" = "Näytä AV-säätimet";
"qtpHideAVControls" = "Kätke AV-säätimet";
"qtpShowClosedCaption" = "Näytä kuulovammaistekstitys";
"qtpHideClosedCaption" = "Kätke kuulovammaistekstitys";
"qtpShare" = "Jaa…";
"qtpStopAllMovies" = "Pysäytä kaikki elokuvat";
"qtpPlayAllMovies" = "Toista kaikki elokuvat";
"qtpShowSoundControls" = "Näytä äänisäätimet";
"qtpHideSoundControls" = "Kätke äänisäätimet";
"qtpHidePropertyInspector" = "Kätke ominaisuusinspektori";
"qtpShowPropertyInspector" = "Näytä ominaisuusinspektori";
"qtpOpenMovie" = "Avaa elokuva…";
"qtpOpenMovieInNewPlayer" = "Avaa elokuva uudessa ikkunassa…";
"qtpOpenURL" = "Avaa osoite…";
"qtpOpenURLInNewPlayer" = "Avaa osoite uudessa ikkunassa…";
"qtpHalfSize" = "Puolikas koko";
"qtpActualSize" = "Todellinen koko";
"qtpDoubleSize" = "Kaksinkertainen koko";
"qtpFitToScreen" = "Sovita näytölle";
"qtpLetterbox" = "Sovita näytölle";
"qtpZoom" = "Täytä näyttö";
"qtpStretch" = "Venytä koko näytölle";
"qtpPanoramicStretch" = "Panoraama";
"qtpMinimize" = "Pienennä";
"qtpClose" = "Sulje";
"qtpFullScreen" = "Siirry koko näytön tilaan";
"qtpExitFullScreen" = "Poistu koko näytön tilasta";
"qtpAXURLPopupButtonValue" = "Valitse osoite";
"qtpAXURLTextTitle" = "Elokuvan osoite";
"qtpExportRefMovieForWebMenuTitle" = "Vie verkkoon ja iPhoneen…";

/* strings for the Undo menu item */
"qtMovieViewEditCut" = "Leikkaa";
"qtMovieViewEditCopy" = "Kopioi";
"qtMovieViewEditPaste" = "Sijoita";
"qtMovieViewEditDelete" = "Poista";
"qtMovieViewEditAdd" = "Lisää elokuvaan";
"qtMovieViewEditAddScaled" = "Lisää valintaan ja skaalaa";
"qtMovieViewEditReplace" = "Korvaa";
"qtMovieViewEditTrim" = "Rajaa valintaan";
"qtMovieViewMove" = "Siirrä";
"qtMovieViewResize" = "Muuta kokoa";
"qtMovieViewDelete" = "Poista";
"qtMovieViewPlace" = "Sijoita";
"qtMovieViewInsert" = "Lisää";
"qtMovieViewDeleteTrack" = "Poista raita";
"qtMovieViewEnableTrack" = "Ota raita käyttöön";

"QTMoviePosterTimeAttribute" = "Aseta elokuvan tunnistekuva";
"QTMovieApertureMode" = "Aseta aukko";
"QTTrackHighQualityVideoAttribute" = "Aseta korkealaatuinen video";
"QTTrackDeinterlaceVideoAttribute" = "Aseta lomituksenpoisto";
"QTTrackSingleFieldVideoAttribute" = "Aseta yksikenttäinen video";
"QTTrackPreloadTrackAttribute" = "Aseta raidan esilataus";
"QTTrackNeverPurgeTrackAttribute" = "Aseta ei poistettava raita";
"QTTrackMatrixAttribute" = "Aseta raidan matriisi";
"QTTrackChapterlistAttribute" = "Aseta kappale";
"QTTrackContentsAttribute" = "Aseta raidan sisällysluettelo";
"QTTrackMaskAttribute" = "Aseta raidan maski";
"QTTrackVolumeAttribute" = "Aseta raidan äänenvoimakkuus";
"QTTrackBalanceAttribute" = "Aseta raidan tasapaino";
"QTTrackHrefAttribute" = "Aseta raidan HREF";
"QTTrackTransferModeAttribute" = "Aseta videon siirtotila";
"QTTrackOperationColorAttribute" = "Aseta videotoiminnon väri";
"QTTrackEnabledAttribute" = "Aseta raita käyttöön";
"QTTrackLanguageAttribute" = "Aseta raidan kieli";
"QTTrackLayerAttribute" = "Aseta raidan taso";
"QTTrackRangeAttribute" = "Aseta raidan alkuaika";
"QTTrackDisplayNameAttribute" = "Aseta raidan nimi";
"QTTrackSourcePositionAttribute" = "Aseta raidan sijainti";
"QTTrackSourceDimensionsAttribute" = "Aseta raidat mitat";


/* track names */
"qtTrackMovieName" = "Elokuva";
"qtTrackMovieTrackName" = "Elokuvaraita";
"qtTrackVideoTrackName" = "Videoraita";
"qtTrackSoundTrackName" = "Ääniraita";
"qtTrackMPEGTrackName" = "MPEG-raita";
"qtTrackChapterTrackName" = "Kappaleraita";
"qtTrackTextTrackName" = "Tekstiraita";
"qtTrackSpriteTrackName" = "Grafiikkahahmoraita";
"qtTrackTimeCodeTrackName" = "Aikakoodiraita";
"qtTrackFlashTrackName" = "Flash-raita";
"qtTrackTweenTrackName" = "Tween-raita";
"qtTrackMusicTrackName" = "Musiikkiraita";
"qtTrackSkinTrackName" = "Ulkoasuraita";
"qtTrackThreeDeeTrackName" = "3D-raita";
"qtTrackUnknownTrackName" = "Tuntematon raita";
"qtTrackFourCharCodeTrackName" = "Raita ”%@”";

/* capture */
"qtpCaptureBaseMovieFileName" = "Elokuva";
"qtpCaptureBaseAudioFileName" = "Ääni";
"qtpCaptureDiskFullTitle" = "Tallentaminen keskeytyi, koska levy on täynnä.";
"qtpCaptureDiskFullMessage" = "Vapauta levytilaa poistamalla tiedostoja.";
"qtpCaptureWriteFailTitle" = "Tallentaminen ei voinut luoda tiedostoa.";
"qtpCaptureWriteFailMessage" = "Levy saattaa olla täynnä tai kirjoitussuojattu.";
"qtpCaptureFailedTitle" = "Tallentaminen epäonnistui.";
"qtpCaptureFailedMessage" = "Tallentaminen epäonnistui elokuvan luomisessa.";
"qtpCaptureNoDeviceTitle" = "Tallennuslaitteita ei löytynyt.";
"qtpCaptureNoDeviceMessage" = "Varmista, että tallennuslaite on liitetty tietokoneeseen eikä ole toisen ohjelman käytössä.";
"qtpCaptureDiskNearlyFullTitle" = "Levy on lähes täynnä.";
"qtpCaptureDiskNearlyFullMessage" = "Kaappaus loppuu automaattisesti %d sekunnin kuluttua.";
"qtpKeep" = "Pidä";
"qtpDontKeep" = "Älä säilytä";

/* QTPMovieDocumentController strings */
"qtpMovieDocumentControllerClearMenu" = "Tyhjennä valikko";

/* full screen */
"qtpExitFullScreenInstructions" = "Poistu koko näytön tilasta painamalla Esc.";

/* movie data size units */
"qtpMovieDataSizeUnitsBytes" = "t";
"qtpMovieDataSizeUnitsKiloBytes" = "Kt";
"qtpMovieDataSizeUnitsMegaBytes" = "Mt";
"qtpMovieDataSizeUnitsGigaBytes" = "Gt";
"qtpMovieDataSizeUnitsTeraBytes" = "Tt";
"qtpMovieDataSizeUnitsPetaBytes" = "Pt";
"qtpMovieDataSizeUnitsExaBytes" = "Et";

/* movie data rate units */
"qtpMovieDataRateUnitsBytes" = "t/s";
"qtpMovieDataRateUnitsKiloBytes" = "Kt/s";
"qtpMovieDataRateUnitsMegaBytes" = "Mt/s";
"qtpMovieDataRateUnitsGigaBytes" = "Gt/s";
"qtpMovieDataRateUnitsTeraBytes" = "Tt/s";
"qtpMovieDataRateUnitsPetaBytes" = "Pt/s";
"qtpMovieDataRateUnitsExaBytes" = "Et/s";

/* LCD strings */
"qtpLCDLiveBroadcast" = "Suora lähetys";
"qtpLCDLiveBroadcastPaused" = "Suora lähetys - keskeytetty";

/* Time Code Strings */ 
"qtpLCDTimeCodeDropFrame" = "Aikakoodi: pudotuskehys";
"qtpLCDTimeCodeNonDropFrame" = "Aikakoodi: ei pudotuskehys";
"qtpLCDTimeCodeStandard" = "Normaali";
"qtpLCDTimeCodeFrameNumber" =  "Kehyksen numero";

/* version */
"qtpOldQuickTime" = "Vanha QuickTime";
"qtpOldQuickTimeError" = "Päivitä QuickTime 7.0:aan tai uudempaan.";
"qtpCopyright" = "Copyright © 1989 - 2010 Apple Inc.\nKaikki oikeudet pidätetään.";
"qtpVersion" = "QuickTime™-versio %@, Player-versio %@";
"qtpQuickTimeVersion" = "QuickTime™-versio %@ (%@)";
"qtpQTKitVersion" = "QTKit-versio %@ (%@)";

/* languages */
"qtpLanguageSystemDefault" = "(Järjestelmän oletus)";
"qtpLanguageEnglish" = "Englanti";
"qtpLanguageFrench" = "Ranska";
"qtpLanguageGerman" = "Saksa";
"qtpLanguageItalian" = "Italia";
"qtpLanguageDutch" = "Hollanti";
"qtpLanguageSwedish" = "Ruotsi";
"qtpLanguageSpanish" = "Espanja";
"qtpLanguageDanish" = "Tanska";
"qtpLanguagePortuguese" = "Portugali";
"qtpLanguageNorwegian" = "Norja";
"qtpLanguageHebrew" = "Heprea";
"qtpLanguageJapanese" = "Japani";
"qtpLanguageArabic" = "Arabia";
"qtpLanguageFinnish" = "Suomi";
"qtpLanguageGreek" = "Kreikka";
"qtpLanguageIcelandic" = "Islanti";
"qtpLanguageMaltese" = "Malta";
"qtpLanguageTurkish" = "Turkki";
"qtpLanguageCroatian" = "Kroatia";
"qtpLanguageTraditionalChinese" = "Perinteinen kiina";
"qtpLanguageUrdu" = "Urdu";
"qtpLanguageHindi" = "Hindi";
"qtpLanguageThai" = "Thai";
"qtpLanguageKorean" = "Korea";
"qtpLanguageLithuanian" = "Liettua";
"qtpLanguagePolish" = "Puola";
"qtpLanguageHungarian" = "Unkari";
"qtpLanguageEstonian" = "Viro";
"qtpLanguageLatvian" = "Latvia";
"qtpLanguageSaamisk" = "Saame";
"qtpLanguageFaroese" = "Fääri";
"qtpLanguageFarsi" = "Farsi";
"qtpLanguageRussian" = "Venäjä";
"qtpLanguageSimplifiedChinese" = "Yksinkertaistettu kiina";
"qtpLanguageFlemish" = "Flaami";
"qtpLanguageIrish" = "Iiri";
"qtpLanguageAlbanian" = "Albania";
"qtpLanguageDefault" = "Oletus";

/* progress */
"qtpProgressFlatteningMovie" = "Tasoitetaan elokuvaa…";
"qtpProgressInsertingTrackSegment" = "Lisätään raitasegmenttiä…";
"qtpProgressInsertingMovieSegment" = "Lisätään elokuvasegmenttiä…";
"qtpProgressPasting" = "Sijoitetaan…";
"qtpProgressAddingMovieSelection" = "Lisätään elokuvavalintaa…";
"qtpProgressCopying" = "Kopioidaan…";
"qtpProgressCutting" = "Leikataan…";
"qtpProgressLoadingMovieIntoRAM" = "Ladataan elokuvaa muistiin…";
"qtpProgressLoadingTrackIntoRAM" = "Ladataan raitaa muistiin…";
"qtpProgressLoadingMediaIntoRAM" = "Ladataan mediaa muistiin…";
"qtpProgressImportingMovie" = "Tuodaan elokuvaa…";
"qtpProgressExportingMovie" = "Viedään elokuvaa…";

/* device support */
"qtpDeviceSupportSendPrompt" = "Lähetä";
"qtpDeviceSupportExportingMovie" = "Viedään elokuvaa…";
"qtpDeviceSupportWaiting" = "Odotetaan, että %@ hyväksyy kohteen...";
"qtpDeviceSupportNegotiating" = "Neuvotellaan…";
"qtpDeviceSupportWaitingForDevice" = "Odotetaan laitetta…";
"qtpDeviceSupportTransferring" = "Siirretään elokuvaa kohteeseen %@…";
"qtpDeviceSupportTransferringFile" = "Siirretään tiedostoa";
"qtpDeviceSupportBadRequestError" = "Virheellinen pyyntö";

/* sound */
"qtpSoundChannel" = "Kanava";
"qtpSoundUnknown" = "Tuntematon";
"qtpSoundMono" = "Mono";
"qtpSoundStereo" = "Stereo";
"qtpSoundHertz" = " Hz";
"qtpSoundNone" = "Ei mitään";
"qtpSoundMACE3to1" = "MACE 3:1";
"qtpSoundMACE6to1" = "MACE 6:1";
"qtpSoundBits" = "bittiä";
"qtpSoundNotApplicable" = "Ei sovellu";
"qtpSoundBigEndian" = "Big endian";
"qtpSoundLittleEndian" = "Little endian";
"qtpSoundInteger" = "Kokonaisluku";

/* accessibility */
"qtpMute" = "mykistä";
"qtpVolume" = "äänenvoimakkuus";
"qtpSelectionStart" = "valinnan alku";
"qtpSelectionEnd" = "valinnan loppu";
"qtpMarker" = "merkki";
"qtpCurrentTime" = "nykyinen aika";
"qtpBack" = "edellinen";
"qtpZoomOut" = "loitonna";
"qtpAXRecordButtonTitle" = "tallenna";
"qtpAXStopButtonTitle" = "pysäytä";
"qtpAXPlayButtonTitle" = "toista";
"qtpAXPauseButtonTitle" = "keskeytä";
"qtpZoomIn" = "lähennä";
"qtpShowHotspots" = "näytä toimintopisteet";
"qtpGotoBeginning" = "siirry alkuun";
"qtpFastRewind" = "selaa taaksepäin";
"qtpFastForward" = "selaa eteenpäin";
"qtpGotoEnd" = "siirry loppuun";
"qtpAXEqualizerRoleDescription" = "taajuuskorjain";
"qtpAXGainSliderTitle" = "äänenvoimakkuus";
"qtpAXBassSliderTitle" = "perus";
"qtpAXTrebleSliderTitle" = "diskantti";
"qtpAXBalanceSliderTitle" = "balanssi";
"qtpAXFadeSliderTitle" = "häivytys";
"qtpAXBrightnessSliderTitle" = "kirkkaus";
"qtpAXColorSliderTitle" = "väri";
"qtpAXContrastSliderTitle" = "kontrasti";
"qtpAXTintSliderTitle" = "sävy";
"qtpAXBassTextLabelTitle" = "perus";
"qtpAXLeftTextLabelTitle" = "vasen";
"qtpAXRightTextLabelTitle" = "oikea";
"qtpAXFrontTextLabelTitle" = "etu";
"qtpAXBackTextLabelTitle" = "edellinen";
"qtpOneHalfTextLabelTitle" = "puolikas";
"qtpAXButtonRoleDescription" = "painike";
"qtpPress" = "puristus";
"qtpIncrement" = "lisäys";
"qtpDecrement" = "vähennys";
"qtpTimeLine" = "elokuvan aikajana";
"qtpTimeLineHelp" = "Elokuvan aikajanan säädin, jolla voidaan selata elokuvaa";
"qtpCurrentTimeHelp" = "Elokuvan aikajanan toistopaikan säädin, jolla voidaan selata elokuvaa";
"qtpSelectionStartHelp" = "Elokuvan aikajanan valintasäädin, jolla voidaan merkitä valinnan alkuaika elokuvassa";
"qtpSelectionEndHelp" = "Elokuvan aikajanan säädin, jolla voidaan merkitä valinnan loppuaika elokuvassa";
"qtpMeterView" = "äänimittari";

/* export */
"qtpExportWindowTitle" = "Vienti";
"qtpExport" = "Vie %@";
"qtpFlatten" = "Tasoita";
"qtpExportFailed" = "Vienti epäonnistui";
"qtpExportFailedError" = "Vienti epäonnistui.";
"qtpDefaultSettings" = "Oletusasetukset";
"qtpCalculatingEstimatedTime" = " - Lasketaan arvioitua aikaa…";
"qtpMinutesRemains" = " - noin %d minuuttia jäljellä";
"qtpOneMinuteRemains" = " - noin %d minuutti jäljellä";
"qtpHoursMinutesRemain" = " - noin %d tuntia %d minuuttia jäljellä";
"qtpExportStopAndQuit" = "Haluatko varmasti pysäyttää viemisen ja lopettaa?";
"qtpCaptureClose" = "Haluatko säilyttää nykyisen tallenteen?";
"qtpCaptureCloseExplanation" = "Tallennus on meneillään ja tallenne poistetaan, jos et halua säilyttää sitä.";
"qtpCouldNotSaveToFolder" = "Kansioon %@ tallentaminen epäonnistui.";
"qtpCannotReplaceFileWithFolder" = "Kansiota %@ ei voitu luoda, koska samanniminen tiedosto on jo olemassa.";
"qtpCannotReplaceFileWithFolderSuggestion" = "Siirrä tai nimeä alkuperäinen tiedosto uudelleen tai muuta vietyjen tiedostojen nimeä.";

/* save as */
"qtpSaveAsFailed" = "Nimellä tallentaminen epäonnistui";
"qtpSaveAsFailedError" = "Tiedostonimessä on virheellisiä merkkejä.\nPoista tiedostonimestä kaikki /-merkit.";
"qtpSave" = "Tallenna";
"qtpCustom" = "Muokattu";
"qtpCustomSettings" = "Muokatut asetukset";
"qtpQuickTimeMovie" = "QuickTime-elokuva";
"qtpReference" = "Viite";
"qtpSettings" = "Asetukset";
"qtpRecentSettings" = "Äskeiset asetukset";
"qtpShowAllSettings" = "Näytä kaikki asetukset…";
"qtpSaveSetting" = "Tallenna asetus…";
"qtpReplaceSetting" = "Korvaa asetus";
"qtpReplace" = "Korvaa";
"qtpReplaceWarning" = "Tämän niminen asetus on jo olemassa.\nHaluatko korvata sen?";
"qtpDeleteSetting" = "Poista asetus";
"qtpDelete" = "Poista";
"qtpDeleteWarning" = "Haluatko varmasti poistaa tämän asetuksen?";
"qtpCancel" = "Kumoa";
"qtpMyCustomSetting" = "Omat asetukset";
"qtpThisIsCustom" = "Tämä on muokattu";
"qtpFilesExist" = "Kansiossa %@ on jo seuraavat tiedostot. Haluatko korvata ne?";
"qtpFilesExistExplanation" = "%@\n\nKansiossa %@ on jo samannimisiä tiedostoja. Tiedostojen korvaaminen korvaa niiden sisällön.";

/* share */
"qtpShareDefaultName" = "Nimetön";
"qtpShareToPodcast" = "Jaa ”%@” menetelmällä ”%@” Podcast Serverissä";
"qtpShareToMail" = "Jaa ”%@” Mailissa";
"qtpShareToiPod" = "Jaa ”%@” iPodissa";
"qtpPending" = "Odotetaan…";
"qtpStarting" = "Aloitetaan…";
"qtpStarted" = "Aloitettu";
"qtpFailed" = "Epäonnistui";
"qtpFailedExitCode" = "Epäonnistui: Vientiprosessi lopetti yllättäen toimintansa";
"qtpFailedSignal" = "Epäonnistui: Vientiprosessi lopetti yllättäen toimintansa";
"qtpWaiting" = "Odotetaan…";
"qtpContinuing" = "Jatketaan…";
"qtpShareVideoSummary" = "{%0}, {%1} x {%2}, {%3} fps";
"qtpShareAudioSummary" = "{%0}, {%1}, {%2} kHz";
"qtpShareiPodVideoSummary" = "{%0}, {%1} x {%2}";
"qtpShareiPodAudioSummary" = "{%0}, {%1}";
"qtpSharePodcastNoServerName" = "Palvelinosoite puuttuu";
"qtpSharePodcastNoUserName" = "Käyttäjätunnus puuttuu";
"qtpSharePodcastNoPassword" = "Salasana puuttuu";
"qtpSharePodcastInvalidServerName" = "Virheellinen palvelinosoite";
"qtpSharePodcastNoPasswordMessage" = "Syötä salasana annetulle käyttäjälle ja palvelinnimelle";
"qtpSharePodcastNoUserNameMessage" = "Syötä käyttäjätunnus annetulle palvelinnimelle";
"qtpSharePodcastNoServerNameMessage" = "Syötä palvelinnimi annetulle käyttäjälle ja salasanalle";
"qtpKeyChainMessage" = "Avainnippuviesti:";
"qtpKeyChainPasswordQuestion" = "Haluatko tallentaa salasanan avainnippuun?";
"qtpPodcastWorkflowLoading" = "Ladataan…";
"qtpPodcastWorkflowDone" = "Valmis";

/* Podcast Producer Server error messages */
"qtpSharePodcastServerMessageFormat" = "%@: %@";
"qtpSharePodcastServerMessage" = "Sisäänkirjautuminen epäonnistui, koska tapahtui palvelinvirhe";
"qtpSharePodcastServerMessage_10" = "Jotta voit kirjautua sisään palvelimelle, sinun on oltava kirjautuneena sisään tietokoneelle root-käyttäjänä.";
"qtpSharePodcastServerMessage_11" = "Plist-tiedostoa luettaessa tai kirjoitettaessa tapahtui virhe.";
"qtpSharePodcastServerMessage_12" = "Tapahtui sisäinen parametrivirhe.";
"qtpSharePodcastServerMessage_20" = "Palvelin ei ole tällä hetkellä käytettävissä.";
"qtpSharePodcastServerMessage_21" = "Määriteltyä palvelinta ei löytynyt.";
"qtpSharePodcastServerMessage_22" = "Palvelin ei vastannut ennen aikakatkaisua.";
"qtpSharePodcastServerMessage_23" = "SSL ei ole käytössä palvelimella.";
"qtpSharePodcastServerMessage_24" = "Palvelin ei tarjonnut kelvollista varmennetta.";
"qtpSharePodcastServerMessage_25" = "Palvelin vastasi virheellisesti.";
"qtpSharePodcastServerMessage_26" = "Syötetty käyttäjätunnus tai salasana on virheellinen.";
"qtpSharePodcastServerMessage_30" = "Palvelin ei voinut luoda lähetystä.";
"qtpSharePodcastServerMessage_31" = "Vastaanottava palvelin ei ole tällä hetkellä käytettävissä.";
"qtpSharePodcastServerMessage_32" = "Tiedostoa ei voitu lähettää.";
"qtpSharePodcastServerMessage_33" = "Tiedostoa ei voitu kopioida.";
"qtpSharePodcastServerMessage_34" = "Lähetystä ei voitu suorittaa loppuun.";
"qtpSharePodcastServerMessage_35" = "Palvelin ei voinut sitoa agenttiin.";
"qtpSharePodcastServerMessage_36" = "Palvelin ei voinut lähettää komentoa agentille.";
"qtpSharePodcastServerMessage_37" = "Tapahtui tuntematon virhe.";

/* sandbox */
"qtpParseError" = "Jäsennysvirhe";
"qtpExporting" = "Viedään";
"qtpExportFinished" = "Vienti suoritettu";
"qtpPublishing" = "Julkaistaan";
"qtpPublishFailed" = "Julkaisu epäonnistui";
"qtpPublishFinished" = "Julkaisu suoritettu";
"qtpFinished" = "Valmis";
"qtpUploading" = "Lähetetään";
"qtpUploadingToPodcastProducer" = "Lähetetään Podcast Produceriin";

"favoritesTitle" = "Suosikit";
"fileNotFound" = "Tiedostoa ei voitu avata, koska sitä ei löytynyt.";
"deleteConfirmation" = "Haluatko varmasti poistaa suosikin";
"deleteMultipleConfirmation" = "Haluatko varmasti poistaa valitut suosikit?";
"questionMark" = "?";
"undoneMessage" = "Tätä toimintoa ei voida perua.";
"cancelTitle" = "Kumoa";
"iconColumnTitle" = "Suosikki";
"urlColumnTitle" = "Sijainti";

"clearURLsConfirmation" = "Haluatko varmasti tyhjentää äskeiset osoitteet?";

/* movie info window items */
"visualContexts" = "Visuaaliset kontekstit:";
"visualContextsMediaKeySetTo" = "QTKitVisualContext-media-avain on asetettu arvoon ";
"usingVisualContext" = "käytetään visuaalista kontekstia";
"usingGWorld" = "käytetään gworldia";
"disabled" = "ei käytössä";
"enabled" = "käytössä";

/* QuickTime Pro */
"getQuickTime7ProPanelMessage" = "\n\nHanki QuickTime 7 Pro, niin saat käyttöösi tämän ja kymmeniä muita hienoja ominaisuuksia, mukaan lukien iPodiin ja Apple TV:hen viemisen.";
"buyNowButton" = "Osta nyt";
"learnMoreButton" = "Lisätietoja";
"buyNowURL" = "http://www.apple.com/fi/quicktime/buy/";
"learnMoreURL" = "http://www.apple.com/fi/quicktime/upgrade/";
"qtpNotNow" = "Ei nyt";

/* Pro Upgrade Messages */
"newDocumentWithTemplateUpgradeMessage" = "Tämä toiminto avaa tyhjän QuickTime Player -ikkunan, jonka avulla voit luoda uuden elokuvan sijoittamalla siihen mediaa tai lisäämällä raitoja.";
"newMovieRecordingUpgradeMessage" = "Uusi elokuvatallenne -komento mahdollistaa videon ja äänen kaappaamisen tietokoneelle yhdellä osoituksella iSightia tai muuta FireWire-kameraa käyttäen.";
"newAudioRecordingUpgradeMessage" = "Tämä toiminto mahdollistaa äänen kaappaamisen tietokoneella elokuvien tai kuvaesitysten selostukseksi yhdellä osoituksella.";
"openImageSequenceUpgradeMessage" = "Tämän toiminnon avulla on helppoa luoda kuvaesityksiä ja animaatioita kuvista ja piirroksista muutamassa helpossa vaiheessa.";
"saveDocumentUpgradeMessage" = "Tallenna-komennolla voit säilyttää muutokset ja toistoasetukset seuraavaan kertaan, kun elokuvaa toistetaan.";
"saveDocumentAsUpgradeMessage" = "Tallenna nimellä -komennolla voit säilyttää muutokset ja toistoasetukset elokuvatiedoston uudelleennimetyssä kopiossa.";
"revertDocumentToSavedUpgradeMessage" = "Tämä toiminto mahdollistaa kaikkien elokuvaan edellisen tallennuskerran jälkeen tehtyjen muutosten perumisen.";
"shareUpgradeMessage" = "Jaa-toiminnolla voit luoda elokuvatiedoston, joka on täydellinen sähköpostilla tai .Macin HomePagella jakamista varten.";
"exportUpgradeMessage" = "Vie-komento tarjoaa satoja erilaisia vaihtoehtoja multimediatiedostojen luomiseen ja muuntamiseen eri muotoihin.";
"exportRefMovieForWebUpgradeMessage" = "Verkkoon vieminen mahdollistaa mediatiedostojen muuntamisen muotoon, joka on optimoitu toimitettavaksi verkon kautta iPhoneen ja työpöydälle.";

"undoUpgradeMessage" = "Peru-komento poistaa elokuvaan tekemäsi viimeisimmän muutoksen.";
"redoUpgradeMessage" = "Tee sittenkin -komento palauttaa elokuvatiedostoon viimeisimmän perumasi muutoksen.";
"copyUpgradeMessage" = "Kopioi-toiminto tekee kaksoiskappaleen elokuvan valitusta osasta ja sijoittaa sen leikepöydälle muualla käyttämistä varten.";
"cutUpgradeMessage" = "Leikkaa-toiminto poistaa elokuvan valitun osan ja sijoittaa sen leikepöydälle muualla käyttämistä varten.";
"pasteUpgradeMessage" = "Sijoita-toiminto sijoittaa leikepöydän sisällön määrittelemääsi kohtaan elokuvassa.";
"deleteUpgradeMessage" = "Poista-komento poistaa elokuvan valitun osan.";
"selectAllUpgradeMessage" = "Valitse kaikki -komento merkitsee koko elokuvan valituksi, jolloin voit suorittaa muokkauskomentoja, kuten leikkaamista ja kopioimista, koko elokuvaan.";
"selectNoneUpgradeMessage" = "Tämä toiminto poistaa valinnan alku- ja loppukohdat, jolloin mikään osa elokuvasta ei ole valittuna.";
"trimUpgradeMessage" = "Tämä toiminto säilyttää elokuvan valitun osan ja poistaa loput.";
"addUpgradeMessage" = "Tämä toiminto lisää leikepöydän sisällön elokuvaan omaksi raidakseen.";
"addScaledUpgradeMessage" = "Tämä toiminto lisää leikepöydän sisällön elokuvaan omaksi raidakseen ja joko venyttää tai lyhentää sitä vastaamaan elokuvassa valittuna olevan alueen pituutta.";
"extractTracksUpgradeMessage" = "Tämä toiminto kopioi valitun raidan erilliseen ikkunaan, jossa sitä voidaan muokata ja tallentaa uutena tiedostona.";
"findTextUpgradeMessage" = "Etsi-komento etsii elokuvan tekstiraidoista määritellyn sanan tai lauseen.";
"findNextTextUpgradeMessage" = "Etsi seuraava -komento etsii elokuvan tekstiraidoista määritellyn sanan tai lauseen seuraavan esiintymän.";
"findPreviousTextUpgradeMessage" = "Etsi edellinen -komento etsii elokuvan tekstiraidoista määritellyn sanan tai lauseen edellisen esiintymän.";

"fullScreenUpgradeMessage" = "Koko näyttö -komento toistaa elokuvan koko näytölle sovitettuna ja sisältää helppokäyttöisen ohjaimen, joka häipyy näkyvistä, kun toisto alkaa.";
"presentMovieUpgradeMessage" = "Esitä elokuva -komento tarjoaa koko- ja toistovaihtoehtoja elokuvan tai kuvaesityksen esittämiseen tasaista taustaa vasten elokuvamaisen tunnelman luomiseksi.";
"loopBackAndForthUpgradeMessage" = "Tämä toiminto toistaa elokuvaa eteen- ja taaksepäin yhä uudelleen ja uudelleen.";
"playSelectionOnlyUpgradeMessage" = "Tämä toiminto toistaa vain valitun osan elokuvasta.";
"playAllFramesUpgradeMessage" = "Tämä toiminto pakottaa QuickTimen toistamaan elokuvan jokaisen kehyksen, myös ne, jotka QuickTime muutoin ohittaisi aikasynkronoinnin vuoksi.";
"playPauseAllUpgradeMessage" = "Tämä toiminto toistaa kaikki avoimet elokuvat samanaikaisesti, jotta voit vertailla saman elokuvan eri versioita tai järjestää monen elokuvan esityksen.";
"gotoPosterFrameUpgradeMessage" = "Tämä toiminto siirtyy kehykseen, joka on asetettu esittelemään elokuvaa käyttäjälle.";
"setPosterFrameUpgradeMessage" = "Tämä toiminto mahdollistaa elokuvan suosikkikehyksen valitsemisen elokuvan ”kansilehdeksi”, jolloin elokuva on helppo tunnistaa ja sisällyttää verkkosivulle.";

"openMoviePropertiesUpgradeMessage" = "Tämä toiminto tarjoaa joukon kehittyneitä tieto- ja muokkaussäätimiä elokuvien tekoon. Voit pyörittää videota, lisätä selitteitä, säätää äänitasoja ja paljon muuta.";
"autoPresentUpgradeMessage" = "Koko näytöllä toistamiseen tarvitaan QuickTime Pro, jota ei ole asennettu tietokoneelle. Jos haluat ostaa QuickTime Pron, vieraile osoitteessa www.apple.com/fi/quicktime.";
"genericUpgradeMessage" = "Tämä toiminto vaatii QuickTime Pron, jota ei ole asennettu tietokoneelle. Jos haluat ostaa QuickTime Pron, vieraile osoitteessa www.apple.com/fi/quicktime.";

/* Pro Upgrade Messages */

/* net diagnosis*/
"netDiagnosticsSheetButton" = "Verkkodiagnostiikka";
"netDiagnosticsSheetMessage" = "Tapahtui verkkovirhe";

/* error handling */
"qtpCouldNotCreateMovie" = "Elokuvaa ei voitu luoda.";
"qtpCouldNotOpenMovie" = "Elokuvaa ei voitu avata.";
"qtpCouldNotSaveMovie" = "Elokuvaa ei voitu tallentaa.";
"qtpCouldNotSaveMovieWithName" = "Elokuvaa ”%@” ei voitu tallentaa.";
"qtpCouldNotPaste" = "Leikepöydän sisältöä ei voitu sijoittaa elokuvaan.";
"qtpCouldNotPasteWithName" = "Leikepöydän sisältöä ei voitu sijoittaa elokuvaan ”%@”.";
"qtpCouldNotDeleteSelection" = "Valintaa ei voitu poistaa elokuvasta.";
"qtpCouldNotDeleteSelectionWithName" = "Valintaa ei voitu poistaa elokuvasta ”%@”.";
"qtpMightExperiencePlaybackProblems" = "Elokuvan toistamisessa saattaa esiintyä ongelmia.";
"qtpMightExperiencePlaybackProblemsWithName" = "Elokuvan ”%@” toistamisessa saattaa esiintyä ongelmia.";
"qtpNonHDCPDisplayDescription" = "Elokuvaa ”%@” ei voida toistaa, koska se on näytöllä, jota ei ole valtuutettu toistamaan suojattuja elokuvia.";
"qtpNonHDCPDisplayRecoverySuggestion" = "Siirrä elokuvaikkuna toiselle näytölle tai irrota kaikki näytöt, jotka eivät ole HDCP-hyväksyttyjä.";
"qtpUnknownError" = "Toimintoa ei voitu suorittaa loppuun.";

"qtpInvalidURLError" = "Osoite on virheellinen.";


"continue" = "Jatka";
"close" = "Sulje";
"stop" = "Pysäytä";

/* time bomb */
"timeBombExpiredMessage" = "Käyttämäsi QuickTime-ohjelmiston esiversio on vanhentunut. Lataa uusin versio ohjelmistosta osoitteesta:\n\n%@\n\n";
"timeBombUpdateURL" = "http://www.apple.com/fi/quicktime/download/";
"quit" = "Lopeta";
"goThere" = "Siirry";
"dontQuit" = "Älä lopeta";
"aboutBoxTimeBombMessage" = "Vanhenee:\n%@";

/*Authorization Message*/
"qtpMovieAuthorization" = "Sisällön katselemiseen tarvitaan valtuutus";

/*Registration*/
/* The text for QuickTime 7 version */
"QT_VERSION_STRING_7" = "QuickTime 7 Pro";
/* The text for QuickTime future versions */
"QT_VERSION_STRING_FUTURE" = "Tuleva QuickTime Pro";
/* The Alert String that shows when a user fails to enter a valid registration in the registration panel*/
"QT_INVALID_REGISTRATION" = "Virheellinen rekisteröinti";

"QT_PROAPP_USER" = "Applen Pro-ohjelmien käyttäjä";
"QT_AUTO" = "Automaattinen";
